{"data":{"markdownRemark":{"html":"<div class=\"content\">\n<p>Kurssilla tutustutaan Javascriptilla tapahtuvaan moderniin websovelluskehitykseen. Pääpaino on React-kirjaston avulla toteutettavissa single page -sovelluksissa, ja niitä tukevissa Node.js:llä toteutetuissa REST-rajapinnoissa. Kurssilla on mukana GraphQL, joka on Facebookin kehittämä REST:ille vaihtoehtoinen tapa rajapintojen toteutukseen.</p>\n<p>Kurssilla käsitellään myös sovellusten testaamista, konfigurointia ja suoritusympäristöjen hallintaa sekä NoSQL-tietokantoja.</p>\n<h3>Oletetut esitiedot</h3>\n<p>Osallistujilta edellytetään vahvaa ohjelmointirutiinia, web-ohjelmoinnin ja tietokantojen perustuntemusta, git-versionhallintajärjestelmän peruskäytön hallintaa, kykyä pitkäjänteiseen työskentelyyn sekä valmiutta omatoimiseen tiedonhakuun ja ongelmanratkaisuun.</p>\n<p>Osallistuminen ei kuitenkaan edellytä kurssilla käsiteltävien tekniikoiden tai Javascript-kielen hallintaa.</p>\n<h3>Kurssimateriaali</h3>\n<p>Kurssimateriaali on tarkoitettu luettavaksi osa kerrallaan \"alusta loppuun\". Materiaalin seassa on tehtäviä, jotka on sijoiteltu siten, että kunkin tehtävän tekemiseen pitäisi olla riittävät tekniset valmiudet sitä edeltävässä materiaalissa. Voit siis tehdä tehtäviä sitä mukaan kun niitä tulee materiaalissa vastaan. Voi myös olla, että koko osan tehtävät kannattaa tehdä vasta sen jälkeen, kun olet ensin lukenut osan alusta loppuun kertaalleen. Useissa osissa tehtävät ovat samaa ohjelmaa laajentavia pienistä osista koostuvia kokonaisuuksia. Muutamia tehtävien ohjelmia kehitetään eteenpäin useamman osan aikana.</p>\n<p>Materiaali perustuu muutamien osasta osaan vaihtuvien esimerkkiohjelmien asteittaiseen laajentamiseen. Materiaali toiminee parhaiten, jos kirjoitat samalla koodin myös itse ja teet koodiin myös pieniä modifikaatioita. Materiaalin käyttämien ohjelmien koodin eri vaiheiden tilanteita on tallennettu GitHubiin.</p>\n<h3>Suoritustapa</h3>\n<p>Kurssi koostuu yhdeksästä osasta, joista ensimmäinen on historiallisista syistä numero nolla. Osat voi tulkita löyhästi ajatellen viikoiksi. Osia kuitenkin ilmestyy nopeampaa tahtia, ja suoritusnopeuskin on melko vapaa.</p>\n<p>Materiaalissa osasta <i>n</i> osaan <i>n+1</i> eteneminen ei ole mielekästä ennen kuin riittävä osaaminen osan <i>n</i> asioista on saavutettu. Kurssilla sovelletaankin pedagogisin termein <i>tavoiteoppimista</i>, <a href=\"https://en.wikipedia.org/wiki/Mastery_learning\">engl. mastery learning</a> ja on tarkoitus, että etenet seuraavaan osaan vasta, kun riittävä määrä edellisen osan tehtävistä on tehty.</p>\n<p>Oletuksena on, että teet kunkin osan tehtävistä <i>ainakin ne</i> jotka eivät ole merkattu tähdellä. Myös tähdellä merkatut tehtävät vaikuttavat arvosteluun, mutta niiden tekemättä jättäminen ei aiheuta liian suuria esteitä seuraavan osan (tähdellä merkkaamattomien) tehtävien tekemiseen.</p>\n<p>Osien <strong>deadlinet</strong> ovat maanantaisin klo 23:59, poikkeuksena kaksi viimeistä osaa, joiden deadline on lauantaina klo 23:59.</p>\n<table>\n<thead>\n<tr>\n<th>osa</th>\n<th align=\"center\">deadline   </th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>osa 0</td>\n<td align=\"center\">ma 20.1.</td>\n</tr>\n<tr>\n<td>osa 1</td>\n<td align=\"center\">ma 27.1.</td>\n</tr>\n<tr>\n<td>osa 2</td>\n<td align=\"center\">ma 3.2.</td>\n</tr>\n<tr>\n<td>osa 3</td>\n<td align=\"center\">ma 10.2.</td>\n</tr>\n<tr>\n<td>osa 4</td>\n<td align=\"center\">ma 17.2.</td>\n</tr>\n<tr>\n<td>osa 5</td>\n<td align=\"center\">ma 24.2.</td>\n</tr>\n<tr>\n<td>osa 6</td>\n<td align=\"center\">ma 2.3.</td>\n</tr>\n<tr>\n<td>osa 7</td>\n<td align=\"center\">la 14.3.</td>\n</tr>\n<tr>\n<td>osa 8</td>\n<td align=\"center\">la 14.3.</td>\n</tr>\n</tbody>\n</table>\n<p>Tämän kurssin eri osiin jo tehtyjen palautusten ajankäyttöstatistiikan näet <a href=\"https://study.cs.helsinki.fi/stats/courses/fullstack2020/\">tehtävien palautussovelluksesta</a>.</p>\n<h3>Arvosteluperusteet</h3>\n<p>Kurssin oletusarvoinen laajuus on 5 opintopistettä. Arvosana määräytyy kaikkien tehtyjen tehtävien perusteella, myös tähdellä merkityt \"vapaavalintaiset\" tehtävät siis vaikuttavat arvosanaan. Noin 50% deadlineen mennessä tehdyistä tehtävistä tuo arvosanan 1 ja 80% arvosanan 5. Kurssin lopussa on koe, joka on suoritettava hyväksytysti. Koe ei kuitenkaan vaikuta arvosanaan.</p>\n<p>Koe pidetään tiistaina 3.3. klo 9 saleissa A111 ja B123. Kokeeseen on ilmoittauduttava viimeistään 10 päivää ennen koetta</p>\n<p>Kurssilta on mahdollisuus ansaita lisäopintopisteitä. Jos teet 87.5% kurssin tehtävistä, saat yhden lisäopintopisteen. Tekemällä 95% tehtävistä saat 2 lisäopintopistettä. </p>\n<h3>Arvosanarajat: 5-7 opintopisteen suoritus</h3>\n<p>5-7 opintopisteen laajuisen suorituksen opintopistemäärä ja arvosana määräytyy kurssin <b>osien 0-7</b> kaikkien tehtyjen tehtävien (myös tähdellä merkittyjen) perusteella.</p>\n<p>Arvosana/opintopisterajat:</p>\n<table>\n<thead>\n<tr>\n<th>tehtäviä</th>\n<th align=\"center\">opintopisteitä</th>\n<th align=\"center\">arvosana</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>139</td>\n<td align=\"center\">7</td>\n<td align=\"center\">5</td>\n</tr>\n<tr>\n<td>128</td>\n<td align=\"center\">6</td>\n<td align=\"center\">5</td>\n</tr>\n<tr>\n<td>117</td>\n<td align=\"center\">5</td>\n<td align=\"center\">5</td>\n</tr>\n<tr>\n<td>106</td>\n<td align=\"center\">5</td>\n<td align=\"center\">4</td>\n</tr>\n<tr>\n<td>95</td>\n<td align=\"center\">5</td>\n<td align=\"center\">3</td>\n</tr>\n<tr>\n<td>84</td>\n<td align=\"center\">5</td>\n<td align=\"center\">2</td>\n</tr>\n<tr>\n<td>73</td>\n<td align=\"center\">5</td>\n<td align=\"center\">1</td>\n</tr>\n</tbody>\n</table>\n<p>Suoritukseen edellytetään tehtävien lisäksi hyväksytysti suoritettu koe.</p>\n<h4>8 opintopisteen suoritus</h4>\n<p>Suorittamalla vähintään 22/26 tehtävää kurssin kahdeksannesta, GraphQL:ää käsittelevästä osasta, voit laajentaa suoritustasi yhdellä opintopisteellä. Voit tehdä GraphQL:ää käsittelevän osuuden periaatteessa jo osan 5 jälkeen sillä sen sisältö ei riipu osista 6 ja 7.</p>\n<p>Osassa 8 tehtyjen tehtävien lukumäärä ei vaikuta kurssin 5-7 opintopisteen laajuuteen laskettavien tehtävien määrään.</p>\n<h3>Aiemmin suoritetun kurssin täydentäminen</h3>\n<p>Jos olet jo suorittanut kurssin joko MOOC:ina tai Yliopiston kurssina, voit täydentää nyt suoritustasi.</p>\n<p>Käytännössä täydentäminen tapahtuu siten, että voit korvata tämän kurssin <i>osia</i> aiemmin suorittamasi kurssin aikana palauttamillasi osilla. Eli jos olet suorittanut kurssin esim. avoimen yliopiston kautta kolmen opintopisteen laajuisena, voit korvata vanhan suorituksesi osilla 0-3 tämän kurssin osat 0-3. Ainoastaan peräkkäisten osien korvaaminen onnistuu, eli et voi korvata esim. osia 0 ja 2 mutta tehdä nyt osaa 1.</p>\n<p>Voit korvata ainoastaan kokonaisia osia, eli jos teit aiemmalla kurssilla esim. 50% jonkin osan tehtävistä, et voi tällä kurssilla jatkaa samaa osaa.</p>\n<p>Jos haluat hyväksilukea vanhan suorituksesi, lähetä emailia osoitteeseen matti.luukkainen@helsinki.fi </p>\n<p>Jos olet tehnyt jo aiemmin kurssin kokeen (poislukien avoimen yliopiston 3 opintopisteen laajuuden koe) ja laajennat suoritustasi nyt, ei uusi kokeeseen osallistuminen enää ole tarpeen.</p>\n<h3>Tehtävien palauttaminen</h3>\n<p>Tehtävät palautetaan GitHubin kautta ja merkitsemällä tehdyt tehtävät <a href=\"https://study.cs.helsinki.fi/stats/courses/fullstack2020\">palautussovellukseen</a>.</p>\n<p>Jos palautat eri osien tehtäviä samaan repositorioon, käytä järkevää hakemistojen nimentää. Voit toki tehdä jokaisen osan omaankin repositorioon, kaikki käy. Jos käytät privaattirepositoriota tehtävien palautukseen, liitä repositoriolle collaboratoriksi <i>mluukkai</i></p>\n<p>Tehtävät palautetaan <strong>yksi osa kerrallaan</strong>. Kun olet palauttanut osan tehtävät, et voi enää palauttaa saman osan tekemättä jättämiäsi tehtäviä.</p>\n<p>GitHubiin palautettuja tehtäviä tarkastetaan plagiaattitunnistusjärjestelmän avulla. Jos GitHubista löytyy kurssin mallivastausten koodia tai useammalta opiskelijalta löytyy samaa koodia, käsitellään tilanne yliopiston <a href=\"https://blogs.helsinki.fi/alakopsaa/opettajalle/epailen-opiskelijaa-vilpista-mita-tehda/\">vilppikäytäntöjen</a> mukaan.</p>\n<p>Suurin osa tehtävistä on moniosaisia, samaa ohjelmaa pala palalta rakentavia kokonaisuuksia. Tällaisissa tehtäväsarjoissa ohjelman lopullisen version palauttaminen riittää, voit toki halutessasi tehdä commitin jokaisen tehtävän jälkeisestä tilanteesta, mutta se ei ole välttämätöntä.</p>\n<h3>Full stack -harjoitustyö</h3>\n<p>Avoimen yliopiston tarjonnassa on 1-10 opintopisteen laajuinen Full Stack -harjoitustyö, johon voit halutessasi osallistua suoritettuasi tämän kurssin vähintään 5 opintopisteen laajuisena.</p>\n<p>Harjoitustyössä toteutetaan vapaavalintainen sovellus Reactilla ja/tai Nodella. Myös React Nativella toteutettu mobiilisovellus on mahdollinen.</p>\n<p>Harjoitustyön opintopistemäärä määrittyy käytettyjen työtuntien mukaan, yksi opintopiste vastaa 17.5 tuntia. Työ arvostellaan skaalalla hyväksytty/hylätty.</p>\n<p>Harjoitustyö on mahdollista tehdä myös pari- tai ryhmätyönä.</p>\n<p>Lisää tietoa harjoitustyöstä avoimen yliopiston <a href=\"https://courses.helsinki.fi/fi/aytkt21010\">sivulla</a>.</p>\n<h3>Alkutoimet</h3>\n<p>Tällä kurssilla suositellaan Chrome-selaimen käyttöä, sillä se tarjoaa parhaan välineistön web-sovelluskehitystä ajatellen.</p>\n<p>Kurssin tehtävät palautetaan GitHubiin, joten Git tulee olla asennettuna ja sitä on syytä osata käyttää. Ohjeita Gitin käyttämiseen löytyy muun muassa <a href=\"https://github.com/mluukkai/ohjelmistotekniikka-kevat2019/blob/master/tehtavat/viikko1.md#gitin-alkeet\">täältä</a>.</p>\n<p>Asenna myös joku järkevä web-devausta tukeva tekstieditori, enemmän kuin suositeltava valinta on <a href=\"https://code.visualstudio.com/\">Visual Studio Code</a>.</p>\n<p>Älä koodaa nanolla, Notepadilla tai Geditillä. Myöskään NetBeans ei ole omimmillaan Web-devauksessa ja se on myös turhan raskas verrattuna esim. Visual Studio Codeen.</p>\n<p>Asenna koneeseesi heti myös <a href=\"https://nodejs.org/en/\">Node.js</a>. Materiaali on tehty versiolla 10.18, älä asenna mitään sitä vanhempaa versiota. Asennusohjeita on koottu <a href=\"https://github.com/fullstack-hy2019/misc/blob/master/asennusohjeita.md\">tänne</a>.</p>\n<p>Noden myötä koneelle asentuu myös <a href=\"https://www.npmjs.com/get-npm\">npm</a> (alunperin lyhennelmä <i>Node Package Manager</i> -nimelle), jota tulemme tarvitsemaan kurssin aikana aktiivisesti. Tuoreen Noden kera asentuu myös <a href=\"https://www.npmjs.com/package/npx\">npx</a>, jota tarvitaan myös muutaman kerran.</p>\n<h3>Typoja materiaalissa</h3>\n<p>Jos löydät kirjoitusvirheen tai jokin asia on ilmaistu epäselvästi tai kielioppisääntöjen vastaisesti, tee <i>pull request</i> repositoriossa <a href=\"https://github.com/fullstack-hy2020/fullstack-hy2020.github.io\">https://github.com/fullstack-hy2020/fullstack-hy2020.github.io</a> olevaan kurssimateriaaliin. Esim. tämän sivun Markdown-muotoinen lähdekoodi löytyy repositoryn alta osoitteesta <a href=\"https://github.com/fullstack-hy2020/fullstack-hy2020.github.io/blob/source/src/content/0/fi/osa0a.md\">https://github.com/fullstack-hy2020/fullstack-hy2020.github.io/blob/source/src/content/0/fi/osa0a.md</a></p>\n<p>Materiaalin jokaisen osan alalaidassa on linkki <em>Ehdota muutosta materiaalin sisältöön</em>, jota klikkaamalla pääset suoraan editoimaan sivun lähdekoodia.</p>\n</div>","frontmatter":{"mainImage":{"publicURL":"/static/part-0-b9999ec785b2c3bc6b8d3ef5d3537538.svg"},"part":0,"letter":"a","lang":"fi"}}},"pageContext":{"part":0,"letter":"a","lang":"fi"}}